views/maklumat-pelajar-penjaga/_form.php

use app\models\LookupPendapatan;
use app\models\LookupPusatPengajian;

$pendapatan = ArrayHelper::map(LookupPendapatan::find()->asArray()->all(), 'id', 'pendapatan');
$pengajian = ArrayHelper::map(LookupPusatPengajian::find()->asArray()->all(), 'id', 'pusat_pengajian');
---
SELECT * FROM `lookup_pendapatan`
SELECT * FROM `lookup_pusat_pengajian`