views/maklumat-pelajar-penjaga/status.php

SELECT * FROM `lookup_pendapatan`
SELECT * FROM `lookup_pusat_pengajian`
---
use app\models\LookupPusatPengajian;
use yii\widgets\DetailView;

$pendapatan = ArrayHelper::map(LookupPendapatan::find()->asArray()->all(), 'id', 'pendapatan');
$pengajian = ArrayHelper::map(LookupPusatPengajian::find()->asArray()->all(), 'id', 'pusat_pengajian');