controllers/MaklumatPelajarPenjagaController.php

SELECT * FROM `maklumat_pilihan_pusat_pengajian` WHERE `id_pelajar`='2844'
---
    public function actionStatus($id)
    {
        $model = $this->findModel($id);
        $model_pusat = MaklumatPilihanPusatPengajian::find()->where(['id_pelajar'=>$id])->one();

SELECT * FROM `maklumat_pelajar_penjaga` WHERE `id`='2844'
---
    protected function findModel($id)
    {
        if (($model = MaklumatPelajarPenjaga::findOne($id)) !== null) {