controllers/TransaksiYuranBulananController.php

    public function actionCreate($id)
    {
        $model = new TransaksiYuranBulanan();
        if ($model->load(Yii::$app->request->post()) ) {

            $model->transaksi = "bayaran";
            $model->jenis_transaksi = "debit";
            $model->id_yuran_bulanan = $id;

            $model->save();
---
INSERT INTO `transaksi_yuran_bulanan` (`bulan`, `tarikh`, `amaun`, `nota`, `no_resit`, `transaksi`, `jenis_transaksi`, `id_yuran_bulanan`) VALUES ('October', '2016-10-18', 1000, '', '', 'bayaran', 'debit', 1)